import odzun1 from "../../images/churches/odzun/odzun1.jpg"
import odzun2 from "../../images/churches/odzun/odzun2.jpg"
import odzun3 from "../../images/churches/odzun/odzun3.jpg"
import odzun4 from "../../images/churches/odzun/odzun4.jpg"
import odzun5 from "../../images/churches/odzun/odzun5.jpg"
import odzun6 from "../../images/churches/odzun/odzun6.jpg"
import bjni1 from "../../images/churches/bjni/bjni1.jpg"
import bjni2 from "../../images/churches/bjni/bjni2.jpg"
import bjni3 from "../../images/churches/bjni/bjni3.jpg"
import bjni4 from "../../images/churches/bjni/bjni4.jpg"
import bjni5 from "../../images/churches/bjni/bjni5.jpg"
import bjni6 from "../../images/churches/bjni/bjni6.jpg"
import areni1 from "../../images/churches/areni/areni1.jpg"
import areni2 from "../../images/churches/areni/areni2.jpg"
import areni3 from "../../images/churches/areni/areni3.jpg"
import areni4 from "../../images/churches/areni/areni4.jpg"
import areni5 from "../../images/churches/areni/areni5.jpg"
import areni6 from "../../images/churches/areni/areni6.jpg"


const churchInitialState={
     churches : [
        {
            name: "Օձունի Սուրբ Աստվածածին Եկեղեցի",
            text: `Օձունը Հայոց Գուգարաց աշխարհի Տաշիր գավառի հնագույն բնակավայրերից է\` հաստատված Դեբեդի կիրճի ձախափնյա բարձրադիր սարահարթի վրա, այժմյան Ալավերդի քաղաքից 8 կմ հարավարևմուտք: Գյուղը և շրջակայքը հարուստ են միջնադարյան ճարտարապետական հուշարձաններով: Գյուղի կենտրոնում է գտնվում V-VIդդ. գմբեթավոր բազիլիկ եկեղեցին: Սա հորինվածքային ընդգծված ընդհանրություն ունի վաղ միջնադարյան եռանավ բազիլիկների հետ: Եկեղեցու կառուցումը ավանդաբար վերագրել են Հովհան Օձնեցուն, ինչն ուսումնասիրողները իրավամբ հավաստի չեն համարում: Ճարտարապետական հորինվածքով և հարդարման գեղարվեստական ոճով մոտ VI դ. վերջի կառույց է: Եկեղեցին անվանվել է Ս. Աստվածածին, Ս. Նշան, Ս. Հովհաննես, Խաչգոնդ, Խաչգունդ. Վերջինս կապված է եկեղեցո ւբակում թաղված Խաչգունդքահանայիանվանհետ, որի հիշատակին 1291 թ. Կանգնեցրել են արձանագրությամբ քանդակազարդ խաչքար: Եկեղեցու մոտ գտնվում է վաղ քրիստոնեական շրջանի կոթող, որը Հայաստանում քրիստոնեության հաղթանակը նշանավորող հոյակապ հուշարձան է:
    
        Գմբեթավոր բազիլիկ եկեղեցի- գտնվում է գյուղի կենտրոնական բարձրադիր մասում: Արևելքից արևմուտք ձգված ուղանկյուն հատակագծով գմբեթավոր բազիլիկ է (20,71×31,62 մ արտաքին չափերով)\` կիսաշրջանաձև խորանին կից երկհարկ ավանդատներով, արտաքին կամարաշար սրահով: Աղոթասրահը ուղղանկյուն դահլիճ է\` երկշար մույթերով բաժանված երեք նավերի: Արտաքին սրահը երեք կողմերից (հյուսիսային, արևմտյան և արևելյան) եզերում է աղոթասրահը:
        
        Եկեղեցին վաղ միջնադարյան եզակի կառույցներից է, որտեղ համեմատաբար ամբողջականորեն է պահպանվել արտաքին սրահը, որի շնորհիվ մեծացել է եկեղեցու ընդհանուր ծավալը: Աղոթասրահը և արտաքին կամարաշար սրահը համաժամանակյա կառույցներ են: Բազիլիկը կառուցված է բազալտի և բաց շագանակագույն ֆելզիտի սրբատաշ քարերով: Աչքի է ընկնում VI-VIIդդ. Վաղ քրիստոնեական արվեստին բնորոշ պատկերաքանդակների և զարդաքանդակների բազմազանությամբ, որոնք կիրառված են չափի բացառիկ զգացումով: Եկեղեցու արտաքին և ներքին պատերին կան բազմաթիվ հայերեն արձանագրություններ
        
        Եկեղեցին բազմիցս նորոգվել է, ինչի մասին հիշատակություններ են պահպանվել եկեղեցու բակում գտնվող տապանաքարերի վրա (801թ., 1888 թ.): XIX դ. վերջերին թիֆլիսաբնակ Զաքարիա և Բաղդասար Աբովյան եղբայրները իրենց նյութական միջոցներով վերանորոգել են եկեղեցին և շրջապարիսպը, ինչը վկայող արձանագրություն ներկան եկեղեցու հյուսիսարևելյան գմբեթակիր մույթի արևմտյան կողմում ամրացված սալի և իրենց մոր\` Եղիսաբեթի տապանաքարի վրա:
        
        Զանգաշտարակներ- եկեղեցու արևելյան ճակատային հարթությունից քիչ վեր, XIX դ. Կառուցել են երկու համաչափ զանգաշտարակներ: Օձնեցի շինարար վարպետ
        
        Նալբանդ Սերգոյի կերտած ճարտարվեստ աշտարակները, լինելով ուշ շրջանի հավելումներ, չեն խաթարում տաճարի ընդհանուր տեսքը:
        
        Գերեզմանատուն – գտնվում է եկեղեցու շուրջ, կան XIII-XX դդ. Բազալտե խոշոր տապանաքարեր, խաչքարեր:
        
        Խորհրդային տարիներին հուշարձանի վերանորոգման և բարեկարգման աշխատանքներ են իրականացվել 1938 թ., 1949-1950-ական թթ., 1977 թ.:`,
            photos: [odzun1, odzun2, odzun3, odzun4, odzun5, odzun6]
        },
        {
            name: "Բջնու Սբ. Աստվածածին վանք",
            text: `Բջնիի Ս. Աստվածածին վանքը գտնվում է ՀՀ Կոտայքի մարզի Բջնի գյուղում: Այն հիմնադրվել է 1031 թ.: Վանքի գլխավոր Սուրբ Աստվածածին եկեղեցին կառուցել է Գրիգոր Մագիստրոս Պահլավունին\` Հովհաննես Սմբատ թագավորի և Պետրոս Ա Գետադարձ կաթողիկոսի կարգադրությամբ: Այստեղ պետք է հաստատվեր եպիսկոպոսական աթոռ:

            Սուրբ Աստվածածին եկեղեցին գմբեթավոր դահլիճ է: Բազմանիստ թմբուկը պսակվում է հովհարաձև տանիք ունեցող գմբեթով: Գիպսե շքեղ շրջանակով երիզված Ավագ խորանի կենտրոնի խորշը եկեղեցու ճարտարապետական և հարդարանքի առանձնահատկություններից մեկն է: Հարկ է նշել նաև պատերի երկայնքով ձգված քարե բարձակային դարակները: Ենթադրվում է, որ նրանք նախատեսված էին վանքում ստեղծված բազմաթիվ ձեռագրերի համար: Սուրբ Աստվածածին վանքը, որը հայտնի էր նաև ՙՄագիստրոսի ճեմարան՚ անվամբ, միջնադարյան հայ գրչության կենտրոն է եղել: Վանքը մեծ համբավ ձեռք բերեց XII դ., Գրիգոր Մագիստրոսի որդի, Հայոց կաթողիկոս Գրիգոր Գ Պահլավունու օրոք:
            
            1209թ. Վահան իշխանը վերանորոգել է Սուրբ Աստվածածին վանքը\` Բջնին Իվանե և Զաքարե իշխանների կողմից սելջուկներից ազատագրելուց հետո (1201թ.): 1211 թ. տեր Վրթանեսը վանքում կառուցել է աշխարհիկ շինություններ: 1272թ. եկեղեցու հարավային մասին կից կառուցվել է թաղածածկ մատուռ: Նրա արևմտյան պատի խորշում տեղադրվել է մի մեծ խաչքար: Վանքի տարածքում կան մեծ համբավ ունեցող վարպետների բազմաթիվ խաչքարեր այդ թվում Մելիքսետ վարպետի ստեղծած երկու խաչքարեր:
            
            Լենկթեմուրի արշավանքի ժամանակ վանքը վնասվել է. վանահայր Վանական վարդապետը սպանվել է եկեղեցում: XV դարում վանքը վերականգնել է իր երբեմնի փառքն ու հեղինակությունը, և նորից դարձել հոգևոր և գիտական խոշոր կենտրոններից մեկը: Այդ ժամանակ վանքում բազմաթիվ ձեռագրեր են ստեղծվել, այդ թվում նաև Գրիգոր եպիսկոպոսի ընդօրինակած Ավետարանը:
            
            Համաձայն պատմական աղբյուրների (պատմիչ Առաքել Դավրիժեցի), վանքը վերանորոգվել է հայ կաթողիկոս Փիլիպոս Ա Աղբակեցու հրամանով և ջուղայեցի Պետրոսի միջոցներով: Վանահայր Մովսես Րաբունապետը (1646-66), որը եղել է Փիլիպոս Ա Աղբակեցու աշակերտը, կառուցել է վանքի հյուսիսային մասում թաղածածկ սեղանատունը, ինչպես նաև շրջանաձև բուրգերով պարիսպները:
            
            1637թ. Բջնիի Ս. Աստվածածին վանքում է գիշերել ֆրանսիացի ճանապարհորդ Շարդենը, որը հետագայում իր ուղեգրություններում տվել է վանքի նկարագրությունը: 1700 թ. վանքն այցելած Ֆրանսիացի բնախույզ Պիտտոն դե Տուրնեֆորը: Տուրնեֆորը նույնպես հիշատակեց այն իր աշխատանքների մեջ:
            
            XIX դ. վանքի հարավային մասում կառուցվել են ուսումնարանի շենքեր, իսկ հյուսիսային կողմում\` խցեր: 1895թ. հայոց կաթողիկոս Մկրտիչ Ա Վանեցու (Խրիմյան Հայրիկ) հրամանով վանքի արևմտյան մասում կառուցվել է դպրոցի շենքը: 1946-ին և 1957-ին Ս.Աստվածածին եկեղեցում տարվում էին վերանորոգման աշխատանքներ:
            
            Բջնիի Սուրբ Աստվածածին վանքի հետ կապված է մի առասպել: Ասում են, որ Բջնիի բերդը և վանքը կապված էին իրար հետ ստորգետնյա ճանապարհով, որով քառանիվ սայլերով պաշարվածներին ուտելիք և խմելիք էին հասցնում: Պեղումների ժամանակ հայտնաբերվել է ստորգետնյա անցումի մի հատված, սակայն ճանապարհի գոյությունը կասկածներ է առաջացնում մասնագետների մոտ: Նրանք հակված են մտածելու, որ դա միայն գեղեցիկ առասպել է\`հորինված Բջնիի բերդի պաշտպանողների սխրանքները փառաբանելու համար:`,
            photos: [bjni1, bjni2, bjni3, bjni4, bjni5, bjni6]
        },
        {
            name: "Ս.Աստվածածին Եկեղեցի, Արենի",
            text: `Արենիի Ս. Աստվածածին եկեղեցին գտնվում է ՀՀ Վայոց Ձորի մարզի Արենի (նախկինում\` Արփա) գյուղից 0.5կմ հեռու, հին Արփա գյուղատեղի ավերակների մեջ, Արփա գետի ձախ ափին, բլրի վրա: Արևմտյան մուտքին կա արձանագրություն, ըստ որի կառուցել է Սյունյաց արքեպիսկոպոս Հովհաննես Օրբելյանը 1321-ին, ճարտարապետն է Մոմիկը: Ըստ ավանդության\`այն կառուցվել է հեթանոսական բագինի կանգնած հիմքերի վրա:Եկեղեցին կառուցված է կարմրասպիտակավուն քարից, կենտրոնագմբեթ է, ունի մեկ զույգ արևմտյան մույթեր, խորանի 2 կողմերում ավանդատներ: Ունի 2 մուտք\` արևմուտքից և հարավից: Մոմիկն այն կառուցելիս հրաժարվել է 13-14-րդ դարերի պաշտամունքային ավանդական ձևերից\` գմբեթը հենելով երկու առանձին կանգնած մույթերի վրա, այդպիսի բան ժամանակի ոչ մի ուրիշ հուշարձանում չկա: Ինքնատիպ են խորանի զույգ խաչաձև լուսամուտները, որոնք նույնպես Մոմիկի ձեռագիրն են:

            Արևմտյան մուտքի ճակատակալ քարին Աստվածամոր գծանկարն է\` գահավորակի վրա բազմած Աստվածամայրն է\` մանուկ Հիսուսը գրկին, Տիրամայրը պատկերված է որպես երկնային թագուհի: «Աստվածամայրը մանուկ Հիսուսը գրկին» պատկերը հայտնի է «Օդիգիտրիա» անունով, որը հունարենից նշանակում է «ուղի ցույց տվող», այսինքն\` Մարիամը մանուկ Հիսուսին որպես փրկության ուղի է ցույց տալիս:
            
            Արևմտյան մուտքից ներս մտնողի առջև միանգամից բացվում է եկեղեցու ողջ ներքին տարածքը, իսկ գմբեթակիր կամարների 4 անկյուններում 4 ավետարանիչների բարձրաքանդակներն են\` նրանց խորհրդանիշները\` հրեշտակ, թևավոր առյուծ, թևավոր ցուլ (եզ) և արծիվ (Մատթևոս ավետարանիչը ներկայացվում է մարդ-հրեշտակի տեսքով, քանի որ նա իր Ավետարանում ավելի շատ անդրադարձել է Հիսուսի երկրային կյանքին: Մարկոս ավետարանիչը ներկայացվում է առյուծի տեսքով, որովհետև նրա Ավետարանում ընդգծվում է Քրիստոսի թագավորական պաշտոնը, ինչն էլ խորհրդանշում է առյուծը: Ղուկաս ավետարանիչը ներկայացվում է եզան կերպարանքով, որովհետև նրա Ավետարանում ընգծվում է Քրիստոսի քահանայական պաշտոնը, ինչն էլ խորհրդանշում է զոհաբերության խորհրդանիշը հանդիսացող եզը կամ ցուլը:Հովհաննես ավետարանիչը պատկերվում է արծվի տեսքով, քանի որ նա խոսել է Հիսուսի 2-րդ գալստյան մասին, իսկ արծիվը խորհրդանշում է աստվածային արդարություն, հավիտենական լույս և փրկություն:)
            
            1967-72-ին նորոգվել են եկեղեցու պատերն ու ծածկը: 1840-ի երկրաշարժից քանդված եկեղեցու գմբեթը 1998-ին պոլսահայ Արտաշես Տյուզմեճյանի բարերարությամբ և Գարեգին Ա կաթողիկոսի հովանավորությամբ վերակառուցվել է իր նախնական տեսքով\` բազմանիստ, կիսասյունիկներով զարդարված, հովանոցաձև վեղարով:
            Եկեղեցու մոտ են գտնվում իշխան Տարսայիճ Օրբելյանի ապարանքի ավերակները, շուրջը\` 14-17-րդ դդ. խաչքարեր և տապանաքարեր:`,
            photos: [areni1, areni2, areni3, areni4, areni5, areni6]
        }

    ] 
}

type ChurchInitialStateType = typeof churchInitialState


export const churchesReducer = (state:ChurchInitialStateType = churchInitialState,action:any):ChurchInitialStateType=>{
    switch(action.type){

    }
    return state
}


