import amberd1 from "../../images/fortresses/amberd/amberd1.jpg"
import amberd2 from "../../images/fortresses/amberd/amberd2.jpg"
import amberd3 from "../../images/fortresses/amberd/amberd3.jpg"
import amberd4 from "../../images/fortresses/amberd/amberd4.jpg"
import amberd5 from "../../images/fortresses/amberd/amberd5.jpg"
import amberd6 from "../../images/fortresses/amberd/amberd6.jpg"
import marzpetunu1 from "../../images/fortresses/marzpetunu/marzpetunu1.jpg"
import marzpetunu2 from "../../images/fortresses/marzpetunu/marzpetunu2.jpg"
import marzpetunu3 from "../../images/fortresses/marzpetunu/marzpetunu3.jpg"
import marzpetunu4 from "../../images/fortresses/marzpetunu/marzpetunu4.jpg"
import marzpetunu5 from "../../images/fortresses/marzpetunu/marzpetunu5.jpg"
import marzpetunu6 from "../../images/fortresses/marzpetunu/marzpetunu6.jpg"
import tigranakert1 from "../../images/fortresses/tigranakert/tigranakert1.jpg"
import tigranakert2 from "../../images/fortresses/tigranakert/tigranakert2.jpg"
import tigranakert3 from "../../images/fortresses/tigranakert/tigranakert3.jpg"
import tigranakert4 from "../../images/fortresses/tigranakert/tigranakert4.jpg"
import tigranakert5 from "../../images/fortresses/tigranakert/tigranakert5.jpg"
import tigranakert6 from "../../images/fortresses/tigranakert/tigranakert6.jpg"



const fortressesInitialState = {
    fortresses: [
        {
            name: "Ամբերդ (ամրոց)",
            text: `Ամբերդ (Անբերդ) ամրոց-բերդաքաղաքը կառուցվել է պատմական Արագածոտն գավառում, ներկայիս ՀՀ Արագածոտնի մարզի Աշտարակի տարածաշրջանի Բյուրական գյուղից 7 կմ հսյուսիս-արևմուտք, Արագածի հարավային լանջին, Արքաշեն և Ամբերդ գետերի միախառնման տեղում\` եռանկյունաձև հրվանդանի վրա: Ամբերդի հիմնադրման ստույգ ժամանակաշրջանը հայտնի չէ: Որոշ գիտնականներ այն վերագրում են կիկլոպյան, ոմանք էլ\` ուրարատական և վաղմիջնադարյան ժամանակաշրջաններին: Պեղումների և պատմահնագիտական ուսումնասի- րությունների հիման վրա Ամբերդ ամրոցը թվագրվում է X-XIII դդ.:

Ըստ պատմական աղբյուրների Ամբերդի շինարարությունը սկսվել է VII-րդ դ. Կամսարական իշխանների կողմից:  X դ. պատկանել է Պահլավունի իշխաններին և եղել Բագրատունյաց  թագավորության  կարևոր ռազմապաշտպանական  հենակետերից և  իր բնական դիրքով ու պաշտպանական կառուցվածքներով  անառիկ ամրոցի համբավ է ունեցել: Նրան էր վերապահված Անի քաղաքի պաշտպանողական օղակի պատասխանատու դերերից մեկը:

X-XIII դդ. ամրոց բերդաքաղաքը ընդգրկում էր մի շարք պատմաճարտարապետական հուշարձաններ\` ամրոցապարիսպներ, Արքաշեն ձորի և Ամբերդաձորի դարպասները, դղյակ, ջրամբարներ, բաղնիք, գաղտնուղիներ, մատուռ, բնակելի շինություններ և Կաթողիկե եկեղեցին: Ներկայումս բերդաքաղաքից պահպանվել են դղյակի (X-XIII դդ.), պարսպապատերի ավերակները, բաղնիքի (X-XI դդ.), այլևայլ շինությունների մնացորդներ և Կաթողիկե եկեղեցին (Վահրամաշեն) (1026 թ.):

Դղյակ – բերդաքաղաքի հյուսիսարևմտյան բարձրադիր մասում կառուցված բազալտաշեն այս համալիրի ավերակների ճարտարապետա-հնագիտական ուսումնասիրություններից եզրակացվել է, որ այն եղել է եռահարկ, որոշ մասերում\` քառահարկ, գերանակազմ միջհարկային ծածկերով և բազմիցս վերակառուցվել, ամրացվել է::

Բաղնիք – գտնվում է դղյակի և Արքաշենի դարպասի մոտ: Կառուցված է սրբատաշ քարերով և ընդհատակյա ջեռուցման համակարգով: Այս ուշագրավ հուշարձանը ունի ուղղանկյուն հատակագիծ\` երկայնական առանցքի նկատմամբ հաջորդաբար տեղավորված հանդերձարանով, լողասրահով և ջեռուցման համակարգով: Սենյակներից մեկի պատին նշմարվում են որմնանկարչության հետքեր:

Մատուռ – գտնվում է բաղնիքի մոտ\` 9 մ. հեռավորության վրա: Այս մատուռը ենթադրվում է, որ կառուցվել է  X դ. ոչ շուտ:

Կաթողիկե (Վահրամաշեն) – Արքաշենի պարսպի մոտ, բերդաքաղաքի կենտրոնական բարձրադիր մասում է գտնվում Վահրամաշեն եկեղեցին\` կառուցված 1026 թ. Վահրամ Պահլավունու հովանավորությամբ: Եկեղեցին ունի խաչաձև գմբեթավոր հորինվածք: ՈՒղղանկյուն հատակագծի մեջ ամփոփված է աղոթասրահը\` արևելյան  կողմի ավագ սեղանով և 4 անկյունների ավանդատներով: Ներքուստ բոլորաձև, արտաքուստ 12 նիստանի թմբուկը հարդարված է զույգ որմնասյուներով և ծածկված է հովանոցաձև վեղարով: Վերջինս ուշագրավ է և նման ծածկի առաջին օրինակն է: Եկեղեցու ներսում\` պատի վրա, գտնվում է եկեղեցու կառուցման վերաբերյալ շինարարական արձանագրությունը: Եկեղեցու արտաքին ճարտարապետությունը պարզ է և անպաճույճ:

Անցած տասնամյակներում Ամբերդում կատարվել են մի շարք հնագիտական պեղումներ և հուշարձանների ամրակայման, վերանորոգման մի շարք աշխատանքներ:

Ամբերդ բերդաքաղաքի տարածքի առաջին պեղումները կատարել է ակադեմիկոս Հ. Օրբելին\` 1936 թ.: Այնուհետև պեղումները շարունակել է ՀՍՍՀ ԳԱ հնագիտության և ազգագրության ինստիտուտը\` 1963-72 թթ., Ն. Տոկարսկու, Ս. Հարությունյանի ղեկավարությամբ: Պեղումների ընթացքում հայտնաբերվել են մետաղյա իրեր, զենքեր, արծաթե զարդեր, խեցեղեն, ապակեղեն, ոսկե, պղնձե դրամներ, մոմակալներ, բրոնզե աշտանակներ և այլ հնագիտական իրեր:

1949-72 թթ. ճարտարապետներ Կ. Ղաֆադարյանի, Ա. Ժամհարյանի, Վ. Հարությունյանի, Ս. Քյուրքչյանի, Ա. Միրիջանյանի կատարած չափագրությունների հիման վրա ճարտարապետ Յու. Թամանյանի կազմած վերանորոգման նախագծով կատարվել է Վահրամաշեն եկեղեցու, բաղնիքի վերանորոգման և ամրակայման աշխատանքներ:

Ամբերդի համալիրում հուշարձանների վերականգնման, բարեկարգման աշխատանքներ են կատարվել նաև 2005-2007 թթ.:`,
            photos: [amberd1, amberd2, amberd3, amberd4, amberd5, amberd6]
        },
        {
            name: "Գեւորգ Մարզպետունու ամրոց",
            text: `Խոսրովի Արգելոցի կողպեքված մուտքին հասնելուց առաջ, խորդուբորդ ճանապարհով թեքվելով ձախ եւ անցնելով մի քանի 100 մետր, կարելի է հասնել երբեմնի հզոր վանքի ավերակներին: Նշված վանքը զբոսաշրջության վերաբերյալ բոլոր գրքերում հայտնի է ՙԳեւորգ Մարզպետունու ամրոց՚ անունով:`,
            photos: [marzpetunu1, marzpetunu2, marzpetunu3, marzpetunu4, marzpetunu5, marzpetunu6]
        },
        {
            name: "Տիգրանակերտի ամրոց",
            text: `Աղդամ քաղաքից 8կմ հյուսիս-արեւմուտք պատմական Արցախ եւ Ուտիք նահանգների սահմանագլխին գտնվում է Տիգրանակերտ բերդ-ամրոցը: Տիգրան Մեծի համբավը հիմք է տվել ենթադրելու, որ ամրոցը կառուցվել է նրա կողմից: Սակայն կա նաեւ վարկած, որ այն կառուցվել է ավելի վաղ\` Տիգրան 1-ի իշխանության օրոք:`,
            photos: [tigranakert1, tigranakert2, tigranakert3, tigranakert4, tigranakert5, tigranakert6]
        },
    ]
}

type FortessesInitialStateType = typeof fortressesInitialState


export const fortressesReducer = (state: FortessesInitialStateType  = fortressesInitialState, action: any): FortessesInitialStateType  => {
    switch (action.type) {

    }
    return state
}


