import garni1 from "../../images/temples/garni/garni1.jpg"
import garni2 from "../../images/temples/garni/garni2.jpg"
import garni3 from "../../images/temples/garni/garni3.jpg"
import garni4 from "../../images/temples/garni/garni4.jpg"
import garni5 from "../../images/temples/garni/garni5.jpg"
import garni6 from "../../images/temples/garni/garni6.jpg"
import zvartnoc1 from "../../images/temples/zvartnoc/zvartnoc1.jpg"
import zvartnoc2 from "../../images/temples/zvartnoc/zvartnoc2.jpg"
import zvartnoc3 from "../../images/temples/zvartnoc/zvartnoc3.jpg"
import zvartnoc4 from "../../images/temples/zvartnoc/zvartnoc4.jpg"
import zvartnoc5 from "../../images/temples/zvartnoc/zvartnoc5.jpg"
import zvartnoc6 from "../../images/temples/zvartnoc/zvartnoc6.jpg"
import echmiadzin1 from "../../images/temples/echmiadzin/echmiadzin1.jpg"
import echmiadzin2 from "../../images/temples/echmiadzin/echmiadzin2.jpg"
import echmiadzin3 from "../../images/temples/echmiadzin/echmiadzin3.jpg"
import echmiadzin4 from "../../images/temples/echmiadzin/echmiadzin4.jpg"
import echmiadzin5 from "../../images/temples/echmiadzin/echmiadzin5.jpg"
import echmiadzin6 from "../../images/temples/echmiadzin/echmiadzin6.jpg"



const templeInitialState={
     temples : [
        {
            name: "Գառնիի հեթանոսական տաճար",
            text: `Գառնիի ամրոցն ու հնավայրը գտնվում է Կոտայքի մարզի համանուն գյուղում, Ազատ գետի աջ ափին։ Ըստ XIVդ. մի ձեռագրի, հիմնադրվել է մ.թ.ա. 2166թ.-ին։ Առաջին անգամ հիշատակում է Տակիտոսը՝ «Gornea» ձևով։ Ելնելով ավանդություններից՝ Մովսես Խորենացին Գառնիի հիմնադրումը վերագրում է Հայկ նահապետի ծոռ Գեղամին, որի թոռան՝ Գառնիկի անունով էլ, իբրև, կոչվել է Գառնի։

            Ամրոցը կառուցվել է հավանաբար մ.թ.ա. IIդ.։ Մ.թ. Iդ. կեսերին այն ավերել են հռոմեական զորքերը։ Iդ. 70-ական թթ. Գառնին վերականգնել է Տրդատ Ա թագավորը, որի թողած հունարեն արձանագրությունում այն անվանված է «անառիկ ամրոց»։ Արտաշեսյան և Արշակունյաց թագավորների օրոք Գառնին եղել է նշանավոր ամրոց, զորակայան և ամառանոց, իսկ IVդ. եպիսկոպոսանիստ բնակավայր։ Ամրոցն ավերվել է արաբական նվաճումների ժամանակ, բայց ավանը պահպանել է իր գոյությունը և IXդ. 2-րդ կեսին աճել ու դարձել է գյուղաքաղաք։ Xդ. սկգբին, Աշոտ Բ Բագրատունի թագավորի օրոք, վերականգնվել է նաև ամրոցը։ X-XVդդ. Գառնին եղել է Հայաստանի առավել խոշոր և նշանավոր գյուղաքաղաքներից մեկը։
            
            Գառնիի հնագիտական պեղումների ժամանակ հայտնաբերվել է մ.թ.ա. III հազարամյակի 2-րդ կեսի վաղ բրոնզեդարյան բնակավայր՝ բոլորակ և քառանկյունի հատակագիծ ունեցող կացարաններով և օջախներով։ Գառնին դեռևս մ.թ.ա. III հազարամյակում եղել է Հայաստանի անասնապահական-երկրագործական բնակավայրերից մեկը։ Հայտնաբերվել են նաև միջին և ուշ բրոնզեդարյան (մ.թ.ա. II հազարամյակ) դամբարաններ և հնագիտական նյութեր, ուրարտական և վաղ հայկական (մ.թ.ա. VI-IVդդ.) խեցեղեն և Արգիշտի թագավորի սեպագիր արձանագրությունը, որի մեջ Գառնին իր շրջակայքով անվանված է Գիառնիյան երկիր։ Ամրոցի առջև եղել է քաղաքատիպ բնակավայր, որի հետքերը ծածկվել են միջնադարյան և նոր ժամանակների կառույցներով։ Գյուղը հյուսիսից երիզող բլրաշարքի վրա գտնվում է միջնադարյան գերեզմանոցը՝ քանդակազարդ խաչքարերով, մակագրված տապանաքարերով։
            
            Ամրոցի այժմյան կառույցը ստեղծվել է մ.թ.ա. III-IIդդ.։ Ռազմա-ամրաշինության այս ուշագրավ սիստեմը կառուցվել է եռանկյունաձև բարձր հրվանդանի վրա, որը հարավային, հարավ-արևմտյան և մասամբ արևելյան կողմերից շրջապատված է բնական անանցանելի ժայռերով, իսկ մնացած հատվածում տասնչորս ուղղանկյուն աշտարակների և ամրակուռ պարսպապատերի հաջորդականությամբ ստեղծվել է պաշտպանական հզոր պատնեշ: Այն հատվածներում, որտեղ հակառակորդի հարձակումը հնարավոր էր ավելի նվազ ուժերով ետ մղել, աշտարակները կառուցված են միմյանցից 25-32մ հեռավորության վրա, իսկ մյուս մասերում միմյանց ավելի մոտ են՝ դրված են 10-13,5մ ավելի ներս՝ ստեղծելով արհեստական աղեղ, որի մեջ ներքաշված հակառակորդի ուժերին ավելի հեշտ է եղել խոցելը։
            
            Ամրոցի շինությունների կոմպոզիցիոն կենտրոնը կազմել է սյունազարդ տաճարը։ Տաճարից արևմուտք, հրվանդանի գրեթե եզրից բարձրացել է պալատական շենքի խոշոր կառուցվածքը։ Բաղնիքի շենքը բաղկացած է միևնույն ուղղությամբ, միմյանց հաջորդող չորս սենյակներից: Առաջին սենյակը, շնորհիվ իր դիրքի և ներքին առավել հարուստ ձևավորման (խճանկարով հատակ, կորագիծ խորշի մեջ ստեղծված ջրավազան և այլն), եղել է բաղնիքի նախասրահ-հանդերձարանը։ Երկրորդ և երրորդ սենյակները, ունենալով հատակագծային միևնույն ձևը և չափերը, եղել են լոգարաններ, երկրորդը՝ սառը ջրի համար, երրորդը՝ գոլ։ Չորրորդ սենյակի մեծ մասը, որ անմիջապես հաջորդում է սառը և գոլ լողասենյակներին և ունի դրանց ձևն ու չափերը, եղել է տաք ջրի լողասենյակը։ Հյուսիս-արևմտյան հատվածում գտնվել է ջրամբարը, հարավ-արևմտյան մասի հատակի տակ՝ կրակարանը ջուր տաքացնելու համար։
            
            Գիտական-գեղարվեստական մեծ հետաքրքրաթյուն է ներկայացնում հանդերձարանի խճանկարը, որը նախաքրիստոնեական Հայաստանի մոնումենտալ գեղանկարչության հուշարձաններից է։ Խճանկարի վրա պատկերված է ծով, ուր ներկայացված են տարբեր աստվածություններ, ջրահարսներ (ներեիդներ), իխտիոկենտավրներ՝ ձիու իրանով ձկան վերջավորությամբ մարդ, ձկնորս, բազմապիսի ձկներ և այլն։ Պատկերներում կան ծովի հետ կապված զանազան արտահայտություններ («Ծովի խորք», «Ծովային անդորր» և այլն) ու աստվածների անուններ (Գլավկոս, Թետիս, Էրոս և այլն)։ Խճանկարի կենտրոնում պատկերված են տղամարդու ու կնոջ կիսանդրիներ, վերը գրված՝ «ոչինչ չստանալով աշխատեցինք» արտահայտությունը։ Խճանկարը պատրաստված է 15 գույնի բնական քարերից, սյուժեն, իրականացման տեխնիկան, ոճային ու գունային առանձնահատկությունները, ինչպես և բաղնիքի շինության կառուցվածքը հիմք են տվել ամբողջ հուշարձանը համարելու IIIդ. գործ։
            
            Հեթանոսական տաճարը կառուցվել է Iդ. 2-րդ կեսին՝ ամրոցի վերակառուցման շրջանում (77թ.)։ Քրիստոնեական կրոնի ընդունումից հետո այն եղել է Տրդատ Գ թագավորի քրոջ՝ Խոսրովդուխտի ամառանոցային սենյակը (հովանոցը)։ Կործանվել է 1679թ.-ի երկրաշարժի ժամանակ։ Շենքը ըստ ընդհանուր, հորինվածքի պերիպտեր է, որի տարածական-ծավալային կառուցվածքը, վեր ելնելով բարձր պատվանդանի վրայից, պսակվում է հարուստ մշակված ճակատներով։ Ենթադրվում է, որ տաճարը նվիրված է եղել արևի աստված Միհրին։ Միհրը, իբրև լույսի, ճշմարտության խորհրդանիշ, հաճախակի պատկերվել է ցուլի (խավարի) դեմ մենամարտելիս։ Տաճարի մոտ գտնվել է սպիտակ մարմարից քանդակված ցուլի կճղակ, որը պատկանել է քրիստոնեական կրոնի տարածման ժամանակ ոչնչացված հեթանոսական կուռքին։`,
            photos: [garni1, garni2, garni3, garni4, garni5, garni6]
        },
        {
            name: "Զվարթնոց տաճար",
            text: `Զվարթնոց կամ ս. Գր. Լուսավորիչ տաճարը եւ կից կաթողիկոսական պալատը կառուցել է Ներսես Գ Շինող կաթողիկոսը 641-661թվերին, այնտեղ, ուր միմյանց են հադիպել Գրիգոր Լուսավորիչը եւ Տրդատ թագավորը (այժմյան Էջմիածին քաղաքից 3 կմ արեւելք): Տաճարը կանգուն է եղել ավելի քան 300 տարի եւ կործանվել է երկրաշարժից: 1900-1907թթ. պեղվել է Խաչիկ վարդապետ Դադյանի կողմից: Այժմ պահպանված են տաճարի եւ պալատի ավերակները:`,
            photos: [zvartnoc1, zvartnoc2, zvartnoc3, zvartnoc4, zvartnoc5, zvartnoc6]
        },
        {
            name: "Էջմիածնի Մայր Տաճար",
            text: `Ս. Էջմիածնի Մայր տաճարը կառուցվել է Վաղարշապատ մայրաքաղաքում, այն վայրում, ուր 301թ.-ին տեսիլք է իջել Միածինը (ըստ սուրբ Գրիգոր Լուսավորիչի), այստեղից էլ ՙԷջք Միածնին՚- Էջմիածին անունը: 480-ական թվականներին իշխան Վահան Մամիկոնյանի վերակառուցած տաճարի հորինվածքը հիմնականում պահպանվել է մինչեւ մեր օրերը: Գլխավոր գմբեթը վերակառուցվել է Մովսես Սյունեցի կաթողիկոսի կողմից 1627թ-ին, իսկ արեւմտյան զանգակատունը\` Փիլիփոս կաթողիկոսի օրոք 1654թ-ին: Աբսիդների վրա երեք զանգակատները կառուցված են 1682թ-ին Եղիազար կաթողիկոսի կողմից:`,
            photos: [echmiadzin1, echmiadzin2, echmiadzin3, echmiadzin4, echmiadzin5, echmiadzin6]
        },
    ] 
}

type TempleInitialStateType = typeof templeInitialState


export const templesReducer = (state:TempleInitialStateType = templeInitialState,action:any):TempleInitialStateType=>{
    switch(action.type){

    }
    return state
}


