import React from "react"
import "slick-carousel/slick/slick.css";
import SliderContainer from "./SliderContainer";


const HomePage = () => {
    return (
        <div className="homePage text-center">
            <div className="homePage__slider">
                <SliderContainer />
            </div>
            <div className="homePage__info">
                <div className="homePage__title">
                    Հայկական մշակույթ
                </div>
                <div className="homePage__text">
                    Հայկական մշակույթը հազարամյակների պատմություն ունի: Հայաստանը լինելով Առաջավոր Ասիայի զարգացած երկրներից մեկը`
                    մշակութային դոնոր է հանդիսացել շրջակա ժողովուրդների համար: Հին հայկական մշակույթի մասին մեզ տեղեկություններ են
                    ավանդվել մինչ օրս պահպանված առասպելներից, ավանդույթներից, կրոնական հավատալիքներից, հնագիտական պեղումների ժամանակ
                    հայտնաբերված նյութերից: Այսօր Հայաստանում զբոսաշրջիկը կարող է տեսնել ավելի քան 5000 պատմական հուշարձան: Միայն մայրաքաղաք
                    Երևանում կան ավելի քան 40 թանգարաններ և պատկերասրահներ: Հելլենիզմի դարաշրջանում կապված հայկական պետության ծաղկման
                    հետ` հայոց մշակույթը հասնում է ծաղկման բարձր աստիճանի: Հայաստանում տասնյակ մեծ ու փոքր քաղաքներ են կառուցվում,
                    զարգանում է նյութական մշակույթը, արվեստները, արհեստները, քանդակագործությունը: Դեռևս մթա 3-րդ դարից Հայաստանում
                    հայտնի է թատրոնը: Թատրոններ եղել են Հայաստանի գրեթե բոլոր մեծ քաղաքներում: Հետագայում էլ հայկակն թատրոնը մեծ
                    զարգացում և ծաղկում ապրեց: Երկրում զարգանում է ամրոցաշինությունը, տաճարաշինությունը... պահպանված եզակի գեղեցկությամբ
                    կառույցներից է Գառնիի տաճարը: Նյութական մշակույթի գոհարներից հայտնի է Անահիտ աստվածուհու բրոնզաձույլ արձանը, որ պահպանվում է
                    Բրիտանական թանգարանում, Երևանի պատմության թանգարանում պահպանվում են ժամանակաշրջանի նյութական մշակույթի բազում արժեքներ:
                    Հայկական երաժշտությունը հայտնի է աշխարհին իր հիասքանչ գոհարներով: Շատ հայտնի է հոգևոր երաժշտությունը` շարականները:
                    Աշխարհին են հայտնի Սայաթ-Նովայի, Կոմիտասի, Արամ Խաչատուրյանի ստեղծագործությունները: Մայրաքաղաք Երևանում հայտնի են
                    այնպիսի արվեստի դարբնոցներ, որպիսիք են օպերայի և բալետի պետական թատրոնը, Կամերային երաժշտության տունը, Ֆիլհարմոնիան...
                    Հայ ժողովրդի կյանքում մեծ դեր է կատարել գրականությունը: Դեռևս հազարամյակներ առաջ հայերը ստեղծել են գրային մշակույթ`
                    սեպագրերի տեսքով: 405 թվականին մաշտոցյան գրերի հայտ գալուց հետո ծաղկում ապրեց գրականությունը: Հայերը ստեղծել և աշխարհին
                    են ժառանգել հարուստ գրական ժառանգություն: Երևանի մատենադարանում այսօր մոտ քսան հազար հին ձեռագիր է պահպանվում,
                    որոնք վկայում են հին Հայաստանում ոչ միայն գիտության, այլև արհեստների և արվեստի բարձր զարգացվածության մասին:
                    Մանավանդ մեծ բարձունքի հասավ հայոց գիտությունը: Միջնադարյան Հայաստանում տասնյակ համալսարաններ են գործել
                    : Դեռևս հազարամյակներ առաջ հայերը ստեղծել են մանրանկարչության գոհարներ: Արվեստի այս ճյուղը զարգացավ հատկապես
                    միջնադարում` կիրառական արվեստի գործերում և հայ մատենագրության մեջ: Միջնադարյան ծաղկողներից հայտնի են Թորոս Ռոսլինի
                    , Սարգիս Պիծակի անզուգական աշխատանքները: Ինչպես նշում են եվրոպական ուսումնասիրողներից շատերը, Եվրոպական
                    վերածնունդը սկսվել է հենց հայաստանից: Հայ նկարիչներից մեծ համբավ են վայելում Մարտիրոս Սարյանը, Մինաս Ավետիսյանը. Հովհաննես
                    Այվազովսկին, Արշիլ Գորկին, Գառզուն, Ժանսեմը... Կիրառական մշակույթից շատ զարգացած են գորգագործությունը, կարպետագործությունը,
                    որի գեղեցիկ նմուշներ այսօր էլ Հայաստանում կարելի է ձեռք բերել: Կիրառական մշակույթը չի սահմանափակվում վերը նշվածով
                    . այն բազմազան է և ներառում է շատ ոլորտներ. քարագործություն, մետաղագործություն... Աշխարհին է հայտնի հայկական խաչքարը:
                    Առհասարակ, քարի մշակման տեխնոլոգիան հնուց Հայաստանում շատ բարձր մակարդակ է ունեցել: Դրա վկայությունն են հայկական
                    ճարտարապետության կոթողները. Էջմիածին, Տաթև, Սանահին, Հաղբատ, Քոբայր... այս եկեղեցիներից շատերը, որ այսօր ՅՈՒՆԵՍԿՕ-ի
                    համաշխարհային ժառանգության ցանկում են, հիացնում են ոչ միայն չքնաղ ճարտարապետությամբ, այլև որմնանկարներով:
                    Հենց հայկական ճարտարապետությունն են նկատի ունեցել, երբ օտար մասնագետները Հայաստանն անվանել են թանգարան բաց երկնքի տակ:
                    Հայաստանի հանրապետություն առանց վիզայի կարող են այցելել հետևյալ երկրների քաղաքացիները. Ավստրիա, Բելգիա, Բուլղարիա,
                    Գերմանիա,Դանիա, Էստոնիա, Իռլանդիա, Իսլանդիա, Իսպանիա, Իտալիա, Լատվիա, Լեհաստան, Լիխտենշտեյն, Լտվա, Լյուքսեմբուրգ, Կիպրոս,
                    Հունաստան, Հունգարիա, Մալթա, Մեծ Բրիտանիա, Նիդերլանդներ, Նորվեգիա, Շվեդիա, Շվեցարիա, Չեխիա, Պորտուգալիա, Ռումինիա, Սլովակիա,
                    Սլովենիա, Ֆինլանդիա, Ֆրանսիա, Խորվաթիա. Արաբական միացյալ էմիրություններ, Արգենտինա, Բելառուս, Բրազիլիա, Եգիպտոս, Թուրքմենստան,
                    Իրան, Լիբանան, Կորեա, Հնդկաստան, Ղազախստան, Ղրղզստան, Մեքսիկա, Մոնտենեգրո, Ուզբեկստան, Ուկրաինա, Ուրուգվայ,
                    Չինաստան, Ռուսաստան, Սերբիա, Սինգապուր, Սիրիա, Վիետնամ, Վրաստան, Տաջիկստան, Քուվեյթ, Ֆիլիպիններ:
                </div>
            </div>
        </div>
    )
}

export default HomePage



